Examinator/src/Catalogs/ТерминыСУЗ/ТерминыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТерминыСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>БукваДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Синонимы</name>
    <comment>Синонимы</comment>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>БукваДляПоиска</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Enums/ТипыОбъектовСУЗ/ТипыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовСУЗ</name>
  <enumValues>
    <name>collection</name>
  </enumValues>
  <enumValues>
    <name>file</name>
  </enumValues>
  <enumValues>
    <name>frame</name>
  </enumValues>
  <enumValues>
    <name>glossary</name>
  </enumValues>
  <enumValues>
    <name>knowledgeBase</name>
  </enumValues>
  <enumValues>
    <name>map</name>
  </enumValues>
  <enumValues>
    <name>page</name>
  </enumValues>
  <enumValues>
    <name>question</name>
  </enumValues>
  <enumValues>
    <name>res</name>
  </enumValues>
  <enumValues>
    <name>term</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ОпределенияТерминаСУЗ/ОпределенияТерминаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОпределенияТерминаСУЗ</name>
  <owners>Catalog.ТерминыСУЗ</owners>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСлева</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженоИзФайла</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ТерминыСУЗ/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Функция ТипОбъектаСУЗ() Экспорт
	
	Возврат Перечисления.ТипыОбъектовСУЗ.term;
	
КонецФункции

// Позволяет получить XML данные объекта.
//
// Параметры
//  ОбъектСУЗ          - экземпляр обработки ОбъектСУЗ.
//  ПараметрыСсылки    – Структура, содержит параметры ссылки по которой вызывается вопрос.
//  КонтекстВыполнения - Структура, содержит параметры контекста выполнения объекта.
//
// Возвращаемое значение:
//   Строка – содержит XML представление объекта СУЗ.
//
Функция ПолучитьXMLПредставление(Термин, ПараметрыСсылки, КонтекстВыполнения) Экспорт

	ИмяОбъектаСУЗ = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ТипОбъектаСУЗ());
	
	XMLДанные = "<ОбъектСУЗ>";
	СловоСиноним = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "word");
	БукваДляПоиска = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(ПараметрыСсылки, "letter");
	
	XMLДанные = XMLДанные + "<ТерминГлоссария  id="""+ Термин.УникальныйИдентификатор() +""" object="""+ ИмяОбъектаСУЗ 
			+"""  СловоСиноним="""+СловоСиноним+""">";
			   
	XMLДанные = XMLДанные + "
			|<НаименованиеТермина><![CDATA["+ Термин.Наименование +"]]></НаименованиеТермина>";
	   
	 КоличествоСинонимов= 0;
	 ВыделитьВариантПредставления = Ложь;
	   
		 Для Каждого Вариант Из Термин.Синонимы Цикл
			Если (ЗначениеЗаполнено(СловоСиноним) И ЗначениеЗаполнено(Вариант.БукваДляПоиска))  Тогда
				Если   НЕ Вариант.БукваДляПоиска = БукваДляПоиска Тогда
		   			Если СловоСиноним = Вариант.Представление Тогда
						ВыделитьВариантПредставления = Истина;  
					Иначе
						ВыделитьВариантПредставления = Ложь;
					КонецЕсли;
			 	КонецЕсли;
			Иначе
				Если (ЗначениеЗаполнено(Вариант.БукваДляПоиска)) Тогда
					Если (БукваДляПоиска = Вариант.БукваДляПоиска) Тогда
						ВыделитьВариантПредставления = Истина;  
					Иначе
						ВыделитьВариантПредставления = Ложь;
					КонецЕсли;
				КонецЕсли;

			КонецЕсли;
			
			XMLДанные = XMLДанные + "
	 			|<Представление>
				|   <ВариантыПредставления>  <![CDATA["+ Вариант.Представление +"]]></ВариантыПредставления>
				|   <ВыделитьВариант>"+?(ВыделитьВариантПредставления, "истина", "ложь")+"</ВыделитьВариант>
				|</Представление>";
				
	 	КонецЦикла;	
		
	 	Запрос = Новый Запрос("ВЫБРАТЬ
			|ОпределенияТерминаСУЗ.Текст, ОпределенияТерминаСУЗ.Ссылка, ОпределенияТерминаСУЗ.Элемент, ОпределенияТерминаСУЗ.ТекстСлева
			|ИЗ
			|Справочник.ОпределенияТерминаСУЗ КАК ОпределенияТерминаСУЗ
			|ГДЕ
			|ОпределенияТерминаСУЗ.ПометкаУдаления = &ПометкаУдаления
			|И ОпределенияТерминаСУЗ.Владелец = &Владелец");

		Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
		Запрос.УстановитьПараметр("Владелец", Термин);
	
		ОпределениеТермина = Запрос.Выполнить().Выбрать();
	
		Пока ОпределениеТермина.Следующий() Цикл
		
		
			XMLДанные = XMLДанные + "<Расшифровка>";
			XMLДанные = XMLДанные + "
				|<ОтображениеТекста>"+?(ОпределениеТермина.ТекстСлева, "истина", "ложь") +"</ОтображениеТекста>";
                   
			Если НЕ ЗначениеЗаполнено(ОпределениеТермина.Текст) Тогда
					ТекстНаличие = Ложь;
			Иначе
					ТекстНаличие = Истина;
					ТекстТерминаГлоссария = ОпределениеТермина.Текст; 
					ТекстОпределенияТермина = ОбщегоНазначенияСУ.ВыделитьТелоHTMLДокумента(ТекстТерминаГлоссария);
		        	XMLДанные = XMLДанные + "
						|<РасшифровкаТермина><![CDATA["+ ТекстОпределенияТермина +"]]></РасшифровкаТермина>";	
			КонецЕсли;
		
			XMLДанные = XMLДанные + "
				|<ТекстНаличие>"+?(ТекстНаличие, "истина", "ложь") +"</ТекстНаличие>";
		
		
			Если НЕ ЗначениеЗаполнено(ОпределениеТермина.Элемент) Тогда
					ЭлементНаличие = Ложь;	
			Иначе 
				ЭлементНаличие = Истина;
				
				СтруктураДанныхОбъектаСУЗЭлемента = ОбъектыСУЗ.ПолучитьПредставление(ОпределениеТермина.Элемент, ПараметрыСсылки, КонтекстВыполнения);

				XMLДанные = XMLДанные + "
					|<Элемент>
					|<ПредставлениеЭлемента><![CDATA["+ СтруктураДанныхОбъектаСУЗЭлемента.Представление +"]]></ПредставлениеЭлемента>
					|<Скрипт><![CDATA["+ СтруктураДанныхОбъектаСУЗЭлемента.Скрипт +"]]></Скрипт>
					|</Элемент>";

				
			КонецЕсли;	
		
			XMLДанные = XMLДанные + "
					|<ЭлементНаличие>"+?(ЭлементНаличие, "истина", "ложь") +"</ЭлементНаличие>";
 		 	XMLДанные = XMLДанные + "</Расшифровка>";

		КонецЦикла;
		
 		XMLДанные = XMLДанные + "</ТерминГлоссария>";
		XMLДанные = XMLДанные + "</ОбъектСУЗ>";
	
		ШаблонОбъекта = ОбъектыСУЗ.ПолучитьСсылкуНаXSLШаблонОбъекта(Термин);
		ОбъектыСУЗ.ДобавитьШаблонВСписокОбъекта(ШаблонОбъекта, КонтекстВыполнения.СписокШаблонов);
                   	
		Возврат XMLДанные;

КонецФункции

#КонецЕсли
